import type { PokemonName } from '@lacolaco/pokemon-data';

/**
 * アイコンが多すぎると見づらいので代表的なポケモンのみを表示する
 */
export const comparisonTargetPokemons: PokemonName[] = [
  // 200
  'レジエレキ',
  // 160
  'マルマイン',
  // 142
  'ドラパルト',
  // 136
  'テツノツツミ',
  'カマスジョー',
  // 135
  'ハバタクカミ',
  'パオジアン',
  // 130
  'レイスポス',
  'サンダース',
  'コオリッポ(ナイス)',
  'ファイアロー',
  // 125
  'マニューラ',
  'タイカイデン',
  // 123
  'オンバーン',
  'マスカーニャ',
  // 122
  'ゲッコウガ',
  // 121
  'モトトカゲ',
  // 120
  'オオニューラ',
  // 119
  'トドロクツキ',
  'エースバーン',
  // 118
  'ルチャブル',
  // 117
  'エンニュート',
  // 116
  'テツノブジン',
  // 115
  'フローゼル',
  'ペルシアン',
  // 112
  'ルガルガン(まひる)',
  // 111
  'サケブシッポ',
  'イッカネズミ',
  // 110
  'オーガポン',
  'テツノドクガ',
  'エーフィ',
  'ゲンガー',
  'ルガルガン(たそがれ)',
  'ライチュウ',
  'ユキメノコ',
  // 109
  'キュウコン(アローラ)',
  // 108
  'テツノコウベ',
  // 106
  'マシマシラ',
  'テツノワダチ',
  // 105
  'フリージオ',
  'ゾロアーク',
  'ストライク',
  'ムウマージ',
  'パーモット',
  'クエスパトラ',
  // 102
  'ガブリアス',
  // 101
  'ボルトロス(化身)',
  'ランドロス(化身)',
  'スナノケガワ',
  // 100
  'サンダー',
  'ケッキング',
  'イルカマン(マイティ)',
  'ボーマンダ',
  'イーユイ',
  'ウルガモス',
  'リザードン',
  'リククラゲ',
  'ケンタロス(パルデア単)',
  // 99
  'キチキギス',
  // 98
  'サザンドラ',
  'バスラオ(赤)',
  // 97
  'オノノクス',
  'ウーラオス(いちげき)',
  // 96
  'ミミッキュ',
  // 95
  'ウインディ',
  'リーフィア',
  'ヘルガー',
  'イエッサン♂',
  // 94
  'デカヌチャン',
  // 92
  'ワルビアル',
  'エクスレッグ',
  // 91
  'ランドロス(霊獣)',
  // 90
  'ウインディ(ヒスイ)',
  'コノヨザル',
  'ルカリオ',
  'アノホラグサ',
  'ピカチュウ',
  // 87
  'セグレイブ',
  'イダイナキバ',
  // 86
  'キラフロル',
  'ウォッシュロトム',
  // 85
  'ゴリランダー',
  'ウェーニバル',
  'ダイケンキ(ヒスイ)',
  'クレセリア',
  'バサギリ',
  'ソウブレイズ',
  'イエッサン♀',
  // 84
  'サーフゴー',
  'スカタンク',
  // 82
  'ルガルガン(まよなか)',
  'オトシドリ',
  'シャリタツ',
  // 81
  'ギャラドス',
  'チヲハウハネ',
  // 80
  'カイリュー',
  'ヌメルゴン',
  'サーナイト',
  'エルレイド',
  'ウォーグル',
  'フワライド',
  'イイネイヌ',
  'オニゴーリ',
  // 78
  'イダイトウ♀',
  'イダイトウ♂',
  // 77
  'ヒードラン',
  // 75
  'フラージェス',
  'グレンアルマ',
  'ストリンダー(ハイ)',
  'スコヴィラン',
  'クレッフィ',
  'タイレーツ',
  'ガケガニ',
  'カジリガメ',
  'ハルクジラ',
  'テツノイバラ',
  'アマージョ',
  'サダイジャ',
  'ドンカラス',
  // 70
  'チオンジェン',
  'パルシェン',
  'レントラー',
  'ポットデス',
  'キリキザン',
  'アップリュー',
  'ミガルーサ',
  'イシヘンジン',
  'レアコイル',
  'キノガッサ',
  'ハカドッグ',
  'アーマーガア',
  'ラウドボーン',
  // 65
  'シャワーズ',
  'ブースター',
  'ブラッキー',
  'グレイシア',
  'ハッサム',
  'ゴチルゼル',
  'ミミズズ',
  'モスノウ',
  'ペリッパー',
  'バンギラス',
  // 60
  'ヌメルゴン(ヒスイ)',
  'ジバコイル',
  'ニンフィア',
  'リキキリン',
  'オーロンゲ',
  'ユキノオー',
  'ヤレユータン',
  'ブロスター',
  // 55
  'アラブルタケ',
  'ハピナス',
  'ノココッチ',
  'リングマ',
  // 52
  'ガチグマ(アカツキ)',
  // 50
  'ガチグマ',
  'テツノカイナ',
  'ドドゲザン',
  'コオリッポ(アイス)',
  'ラッキー',
  'ニャイキング',
  'マリルリ',
  'ヤミラミ',
  'メタモン',
  // 47
  'カバルドン',
  // 45
  'ディンルー',
  'ハラバリー',
  'ドラミドロ',
  // 39
  'オリーヴァ',
  'トリトドン',
  // 35
  'ヘイラッシャ',
  'バンバドロ',
  'キョジオーン',
  'ドヒドイデ',
  'ミカルゲ',
  'シロデスナ',
  'ヌオー',
  'ドータクン',
  'セキタンザン',
  'ダイオウドウ',
  'ヤドラン',
  'ヤドキング',
  'タルップル',
  // 30
  'モロバレル',
  'ブリムオン',
  // 28
  'クレベース',
  // 20
  'ドオー',
  'コータス',
];
